In [99]:
import numpy as np
import pandas as pd
import sqlite3
from pandasql import sqldf

pysqldf = lambda q: sqldf(q, globals())

sqladb=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', header=None)

sqladb.columns=['age', 'workclass', 'fnlwgt', 'education', 'education_num', 'marital_status', 'occupation', 'relationship', 'race', 'sex', 'capital_gain', 'capital_loss', 'hours_per_week', 'native_country', '-']

In [106]:
connection=sqlite3.connect(r"database_sample_test.db")
cursor = connection.cursor()

In [102]:
query_create_table = '''CREATE TABLE SAMPLE(
                        ID INTEGER PRIMARY KEY AUTOINCREMENT,
                        AGE INT,
                        WORKCLASS TEXT,
                        FNLWGT TEXT,
                        EDUCATION TEXT,
                        EDUCATION_NUM TEXT,
                        MARITAL_STATUS TEXT,
                        OCCUPATION TEXT,
                        RELATIONSHIP TEXT,
                        RACE TEXT,
                        SEX TEXT,
                        CAPITAL_GAIN TEXT,
                        CAPITAL_LOST TEXT,
                        HOURS_PER_WEEK TEXT,
                        NATIVE_COUNTRY TEXT); '''

connection.execute(query_create_table)

In [103]:
insert_query = "INSERT INTO SAMPLE( AGE, WORKCLASS, FNLWGT,EDUCATION, EDUCATION_NUM, MARITAL_STATUS, OCCUPATION, RELATIONSHIP, RACE, SEX, CAPITAL_GAIN, CAPITAL_LOST, HOURS_PER_WEEK, NATIVE_COUNTRY) VALUES (%d, '%s', '%s', '%s', '%s', '%s', '%s', '%s', '%s', '%s', '%s', '%s', '%s', '%s')"

for index, row in sqladb.iterrows():
    connection.execute(insert_query % (row['age'], row['workclass'], row['fnlwgt'], row['education'], row['education_num'], row['marital_status'], row['occupation'], row['relationship'], row['race'], row['sex'], row['capital_gain'], row['capital_loss'], row['hours_per_week'], row['native_country']))

connection.commit()

In [107]:
select_query = '''SELECT * FROM SAMPLE limit 10'''
cursor = connection.execute(select_query)

for row in cursor:
    print(row)

(1, 39, ' State-gov', '77516', ' Bachelors', '13', ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', '2174', '0', '40', ' United-States')
(2, 50, ' Self-emp-not-inc', '83311', ' Bachelors', '13', ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', '0', '0', '13', ' United-States')
(3, 38, ' Private', '215646', ' HS-grad', '9', ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', '0', '0', '40', ' United-States')
(4, 53, ' Private', '234721', ' 11th', '7', ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', '0', '0', '40', ' United-States')
(5, 28, ' Private', '338409', ' Bachelors', '13', ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', '0', '0', '40', ' Cuba')
(6, 37, ' Private', '284582', ' Masters', '14', ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', '0', '0', '40', ' United-States')
(7, 49, ' Private', '160187', ' 9th', '5', ' Married-spouse-absent', ' Other-service', ' Not-in-family', ' Black', ' Female', '0', '0', '16', ' Jamaica')
(8, 52, ' Self-emp-not-inc', '209642', ' HS-grad', '9', ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', '0', '0', '45', ' United-States')
(9, 31, ' Private', '45781', ' Masters', '14', ' Never-married', ' Prof-specialty', ' Not-in-family', ' White', ' Female', '14084', '0', '50', ' United-States')
(10, 42, ' Private', '159449', ' Bachelors', '13', ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', '5178', '0', '40', ' United-States')

In [108]:
update_query_1='''update SAMPLE set AGE=45 WHERE ID=4'''
connection.execute(update_query_1)

update_query_2='''update SAMPLE set education_num=54 where ID=8'''
connection.execute(update_query_2)

select_query = '''SELECT * FROM SAMPLE limit 10'''
cursor = connection.execute(select_query)

for row in cursor:
    print(row)

(1, 39, ' State-gov', '77516', ' Bachelors', '13', ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', '2174', '0', '40', ' United-States')
(2, 50, ' Self-emp-not-inc', '83311', ' Bachelors', '13', ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', '0', '0', '13', ' United-States')
(3, 38, ' Private', '215646', ' HS-grad', '9', ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', '0', '0', '40', ' United-States')
(4, 45, ' Private', '234721', ' 11th', '7', ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', '0', '0', '40', ' United-States')
(5, 28, ' Private', '338409', ' Bachelors', '13', ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', '0', '0', '40', ' Cuba')
(6, 37, ' Private', '284582', ' Masters', '14', ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', '0', '0', '40', ' United-States')
(7, 49, ' Private', '160187', ' 9th', '5', ' Married-spouse-absent', ' Other-service', ' Not-in-family', ' Black', ' Female', '0', '0', '16', ' Jamaica')
(8, 52, ' Self-emp-not-inc', '209642', ' HS-grad', '54', ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', '0', '0', '45', ' United-States')
(9, 31, ' Private', '45781', ' Masters', '14', ' Never-married', ' Prof-specialty', ' Not-in-family', ' White', ' Female', '14084', '0', '50', ' United-States')
(10, 42, ' Private', '159449', ' Bachelors', '13', ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', '5178', '0', '40', ' United-States')

In [109]:
delete_query_1='''delete from SAMPLE where ID=6'''
connection.execute(delete_query_1)

delete_query_2="delete from SAMPLE where RELATIONSHIP=' Husband' and RACE=' Black' and NATIVE_COUNTRY=' United-States'" 
connection.execute(delete_query_2)

select_query = '''SELECT * FROM SAMPLE limit 10'''
cursor = connection.execute(select_query)

for row in cursor:
    print(row)

(1, 39, ' State-gov', '77516', ' Bachelors', '13', ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', '2174', '0', '40', ' United-States')
(2, 50, ' Self-emp-not-inc', '83311', ' Bachelors', '13', ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', '0', '0', '13', ' United-States')
(3, 38, ' Private', '215646', ' HS-grad', '9', ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', '0', '0', '40', ' United-States')
(5, 28, ' Private', '338409', ' Bachelors', '13', ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', '0', '0', '40', ' Cuba')
(7, 49, ' Private', '160187', ' 9th', '5', ' Married-spouse-absent', ' Other-service', ' Not-in-family', ' Black', ' Female', '0', '0', '16', ' Jamaica')
(8, 52, ' Self-emp-not-inc', '209642', ' HS-grad', '54', ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', '0', '0', '45', ' United-States')
(9, 31, ' Private', '45781', ' Masters', '14', ' Never-married', ' Prof-specialty', ' Not-in-family', ' White', ' Female', '14084', '0', '50', ' United-States')
(10, 42, ' Private', '159449', ' Bachelors', '13', ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', '5178', '0', '40', ' United-States')
(12, 30, ' State-gov', '141297', ' Bachelors', '13', ' Married-civ-spouse', ' Prof-specialty', ' Husband', ' Asian-Pac-Islander', ' Male', '0', '0', '40', ' India')
(13, 23, ' Private', '122272', ' Bachelors', '13', ' Never-married', ' Adm-clerical', ' Own-child', ' White', ' Female', '0', '0', '30', ' United-States')

In [110]:
filter_query_1="select * from SAMPLE where RACE=' Black' limit 10"
cursor = connection.execute(filter_query_1)

for row in cursor:
    print(row)

(5, 28, ' Private', '338409', ' Bachelors', '13', ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', '0', '0', '40', ' Cuba')
(7, 49, ' Private', '160187', ' 9th', '5', ' Married-spouse-absent', ' Other-service', ' Not-in-family', ' Black', ' Female', '0', '0', '16', ' Jamaica')
(14, 32, ' Private', '205019', ' Assoc-acdm', '12', ' Never-married', ' Sales', ' Not-in-family', ' Black', ' Male', '0', '0', '50', ' United-States')
(22, 54, ' Private', '302146', ' HS-grad', '9', ' Separated', ' Other-service', ' Unmarried', ' Black', ' Female', '0', '0', '20', ' United-States')
(32, 20, ' Private', '266015', ' Some-college', '10', ' Never-married', ' Sales', ' Own-child', ' Black', ' Male', '0', '0', '44', ' United-States')
(72, 31, ' Private', '309974', ' Bachelors', '13', ' Separated', ' Sales', ' Own-child', ' Black', ' Female', '0', '0', '40', ' United-States')
(93, 28, ' Private', '212563', ' Some-college', '10', ' Divorced', ' Machine-op-inspct', ' Unmarried', ' Black', ' Female', '0', '0', '25', ' United-States')
(100, 32, ' Federal-gov', '249409', ' HS-grad', '9', ' Never-married', ' Other-service', ' Own-child', ' Black', ' Male', '0', '0', '40', ' United-States')
(123, 30, ' Private', '77143', ' Bachelors', '13', ' Never-married', ' Exec-managerial', ' Own-child', ' Black', ' Male', '0', '0', '40', ' Germany')
(125, 19, ' Private', '301606', ' Some-college', '10', ' Never-married', ' Other-service', ' Own-child', ' Black', ' Male', '0', '0', '35', ' United-States')

In [111]:
filter_query_1="select * from SAMPLE where RACE=' Black' and AGE<30 limit 10"
cursor = connection.execute(filter_query_1)

for row in cursor:
    print(row)

(5, 28, ' Private', '338409', ' Bachelors', '13', ' Married-civ-spouse', ' Prof-specialty', ' Wife', ' Black', ' Female', '0', '0', '40', ' Cuba')
(32, 20, ' Private', '266015', ' Some-college', '10', ' Never-married', ' Sales', ' Own-child', ' Black', ' Male', '0', '0', '44', ' United-States')
(93, 28, ' Private', '212563', ' Some-college', '10', ' Divorced', ' Machine-op-inspct', ' Unmarried', ' Black', ' Female', '0', '0', '25', ' United-States')
(125, 19, ' Private', '301606', ' Some-college', '10', ' Never-married', ' Other-service', ' Own-child', ' Black', ' Male', '0', '0', '35', ' United-States')
(177, 21, ' Private', '312956', ' HS-grad', '9', ' Never-married', ' Craft-repair', ' Own-child', ' Black', ' Male', '0', '0', '40', ' United-States')
(295, 27, ' Private', '248402', ' Bachelors', '13', ' Never-married', ' Tech-support', ' Unmarried', ' Black', ' Female', '0', '0', '40', ' United-States')
(313, 19, ' ?', '860348', ' Some-college', '10', ' Never-married', ' ?', ' Own-child', ' Black', ' Female', '0', '0', '25', ' United-States')
(327, 23, ' ?', '211601', ' Assoc-voc', '11', ' Never-married', ' ?', ' Own-child', ' Black', ' Female', '0', '0', '15', ' United-States')
(339, 19, ' Private', '104112', ' HS-grad', '9', ' Never-married', ' Sales', ' Unmarried', ' Black', ' Male', '0', '0', '30', ' Haiti')
(345, 22, ' State-gov', '293364', ' Some-college', '10', ' Never-married', ' Protective-serv', ' Own-child', ' Black', ' Female', '0', '0', '40', ' United-States')

In [112]:
function_query_1="select NATIVE_COUNTRY, COUNT(1) FROM SAMPLE group by NATIVE_COUNTRY"
cursor = connection.execute(function_query_1)

for row in cursor:
    print(row)

(' ?', 583)
(' Cambodia', 19)
(' Canada', 121)
(' China', 75)
(' Columbia', 59)
(' Cuba', 95)
(' Dominican-Republic', 70)
(' Ecuador', 28)
(' El-Salvador', 106)
(' England', 90)
(' France', 29)
(' Germany', 137)
(' Greece', 29)
(' Guatemala', 64)
(' Haiti', 44)
(' Holand-Netherlands', 1)
(' Honduras', 13)
(' Hong', 20)
(' Hungary', 13)
(' India', 100)
(' Iran', 43)
(' Ireland', 24)
(' Italy', 73)
(' Jamaica', 81)
(' Japan', 62)
(' Laos', 18)
(' Mexico', 643)
(' Nicaragua', 34)
(' Outlying-US(Guam-USVI-etc)', 14)
(' Peru', 31)
(' Philippines', 198)
(' Poland', 60)
(' Portugal', 37)
(' Puerto-Rico', 114)
(' Scotland', 12)
(' South', 80)
(' Taiwan', 51)
(' Thailand', 18)
(' Trinadad&Tobago', 19)
(' United-States', 28568)
(' Vietnam', 67)
(' Yugoslavia', 16)

In [113]:
function_query_2="select NATIVE_COUNTRY, AVG(HOURS_PER_WEEK) FROM SAMPLE group by NATIVE_COUNTRY"
cursor = connection.execute(function_query_2)

for row in cursor:
    print(row)

(' ?', 41.51286449399657)
(' Cambodia', 40.89473684210526)
(' Canada', 40.40495867768595)
(' China', 37.78666666666667)
(' Columbia', 39.067796610169495)
(' Cuba', 39.1578947368421)
(' Dominican-Republic', 42.47142857142857)
(' Ecuador', 39.57142857142857)
(' El-Salvador', 36.79245283018868)
(' England', 41.833333333333336)
(' France', 45.06896551724138)
(' Germany', 41.01459854014598)
(' Greece', 44.241379310344826)
(' Guatemala', 39.234375)
(' Haiti', 36.90909090909091)
(' Holand-Netherlands', 40.0)
(' Honduras', 36.30769230769231)
(' Hong', 40.9)
(' Hungary', 35.61538461538461)
(' India', 41.53)
(' Iran', 43.97674418604651)
(' Ireland', 42.416666666666664)
(' Italy', 41.602739726027394)
(' Jamaica', 38.592592592592595)
(' Japan', 43.693548387096776)
(' Laos', 40.333333333333336)
(' Mexico', 40.34059097978227)
(' Nicaragua', 36.1764705882353)
(' Outlying-US(Guam-USVI-etc)', 41.857142857142854)
(' Peru', 35.38709677419355)
(' Philippines', 39.5959595959596)
(' Poland', 38.333333333333336)
(' Portugal', 41.891891891891895)
(' Puerto-Rico', 38.57017543859649)
(' Scotland', 41.25)
(' South', 42.4125)
(' Taiwan', 38.88235294117647)
(' Thailand', 45.44444444444444)
(' Trinadad&Tobago', 37.36842105263158)
(' United-States', 40.415709885186224)
(' Vietnam', 37.343283582089555)
(' Yugoslavia', 44.5625)